{

  "schedule": [
    {
      "date": "2016-08-22",
      "groups": [
        {
          "time": "8:00 am",
          "sessions": [
            {
              "name": "Registration",
              "location": "Ballroom",
              "timeStart": "8:30 am",
              "timeEnd": "9:00 am",
              "tracks": ["Admin"]
            }
          ]
        },
        {
          "time": "9:00 am",
          "sessions": [
            {
              "name": "Welcome",
              "location": "Ballroom",
              "description": "For more information about the Agile Africa conference and our sponsors, please see the about page.",
              "speakerNames": ["Jacques de Vos"],
              "timeStart": "9:00 am",
              "timeEnd": "9:20 am",
              "tracks": ["Admin"]
            },
            {
              "name": "A Learning Continent",
              "location": "Ballroom",
              "description": "codeX and WeThinkCode strive to give back to the community. Come join us to see what they have in-store for software in  Africa.",
              "speakerNames": [
                  "codeX",
                  "WeThinkCode"
                ],
              "timeStart": "9:20 am",
              "timeEnd": "10:00 am",
              "tracks": [""]
            }
          ]
        },
        {
          "time": "10:00 am",
          "sessions": [
            {
              "name": "Keynote Talk",
              "location": "Ballroom",
              "description": "Come learn about the difference Agile made at businesses like Spotify and Lego.\n\n Also the alignment issues they had faced; how to get a bunch of autonomous teams to move in the same direction. \n\n Henrik will also talk about agile scaling in general and how individuals have to learn and adapt as businesses changes.",
              "speakerNames": ["Henrik Kniberg"],
              "timeStart": "10:00 am",
              "timeEnd": "11:00 am",
              "tracks": ["Keynote"]
            }
          ]
        },
        {
          "time": "11:00 am",
          "sessions": [
                        {
              "name":"Tea and Move",
              "location":"Indaba Tree Room",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "11:00 am",
              "timeEnd": "11:30 am",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "UX by Wire",
              "description": "This presentation introduces a simple philosophical paradigm: “UX by Wire”.  UX by Wire is driven by the core principles Designing to Learn (D2L) vs Learning to Design (L2D) and design thinking. Through story telling, a series of challenges and learns learnt from                       various products attempting to integrate UX will be shared during the presentation.  The presenters will describe the unique experiences in the transition of marrying UX to agile in the operating model. Also, the presenters will share common themes such as abductive                    reasoning, guerrilla testing, RITE, leaner research design, visibility of outputs, task breakdown and increased collaboration across the feature teams towards the delivery of Most Loved Product (MLP). ",
              "location": "Ballroom",
              "speakerNames": ["Job Mashapa", "Farai Madzima"],
              "timeStart": "11:30 am",
              "timeEnd": "12:00 pm",
              "tracks": [
                  "Building the right thing",
                    "Building thing right",
                    "People and organisational culture",
                    "Quality Early and Testing",
                    "Agile UX and Interaction Design"
              ]
            },
            {
              "name": "Attack Strategies for Taming Legacy Code",
              "description": "The toughest agile journey is the one with a legacy code base.  Define legacy as you wish, but the pain of trying to maintain consistent flow when we touch code after the first or umpteenth release into production is very real.  By far, legacy code is the biggest                       inhibitor to high efficiency in software delivery.  In this talk, I will cover various constraints that slow us down when working with legacy code.  I follow this up with a few strategies that I use to bring a legacy code base under control. Along the way, I also will                  point out techniques that promised a lot and failed me miserably (and why).  I wrap up the talk with an honest statement of what it takes to implement it, without the false promises of silver bullets, magic wands, evangelism and idealism.",
              "location": "Gala Room",
              "speakerNames": ["Aslam Khan"],
              "timeStart": "11:30 am",
              "timeEnd": "12:00 pm",
              "tracks": [
                    "People and organisational culture",
                    "Leadership"
                    ]
            }
          ]
        },
        {
          "time": "12:00 pm",
          "sessions": [
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "12:00 pm",
              "timeEnd": "12:10 pm",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "Why we owe so much to Dr Deming",
              "location": "Ballroom",
              "description": "When it comes to quality, lean and production systems, so much of what we've learnt over the past few decades stems from one man. Someone who was virtually unknown in his own country until a documentary aired in 1980.  After 35 years, that documentary has finally been                  released into the public domain which will hopefully shed some light and fame onto the person responsible for turning around Japanese business after the 2nd World War. That man is Dr Deming. This talk runs through the history of what happened after World War 2 and who                  it is so relevant to everyone in the Agile, Lean, etc... world. Practical advice is pulled from original works dating back 6o years and applied to current business & software development problems.",
              "speakerNames": ["Simon Stewart"],
              "timeStart": "12:10 pm",
              "timeEnd": "12:25 pm",
              "tracks": [
                        "Building the right thing",
                        "Building thing right",
                        "People and organisational culture",
                        "Quality Early and Testing",
                        "Leadership"
                        ]
            },
            {
              "name": "Exploring the Options with PopcornFlow",
              "location": "Gala Room",
              "description": "We all get attached to our solutions. This makes us feel comfortable and secure. It becomes our rock. As product developers we become so immersed in the solution that we lose the perspective required to do the right thing. At worst we fail miserably and don't learn; at best we fail to break out of the status quo and lose out on the chance to innovate. What we want is to succeed by converging on the best possible path! Let's use PopcornFlow to: Make the problem and it's impact visible, Think of the options that address the problem, Explore those options to find the best one.",
              "speakerNames": ["Austin Fagan"],
              "timeStart": "12:10 pm",
              "timeEnd": "12:25 pm",
              "tracks": [
                  "Building the right thing",
                  "Building thing right",
                  "People and organisational culture",
                  "Agile UX and Interaction Design",
                  "Leadership"
                ]
            },
            {
              "name": "Lunch and Discussions",
              "location": "Indaba Tree Room",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "12:25 pm",
              "timeEnd": "1:00 pm",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "1:00 pm",
          "sessions": [
            {
              "name": "Poster Session",
              "location": "Indaba Tree Room",
              "description": "Building Grand Master Engineering Teams\n\nBring it and we shall test! (The context-driven way)\n\nLike dew from the morning sky: Ex post facto agilification of cloud based spiral processes\n\nMy Dev team is brilliantly Agile, but how do I get the rest of the Organisation to see the light?",
              "timeStart": "1:00 pm",
              "timeEnd": "1:50 pm",
              "tracks": ["Poster"]
            },
            {
              "name": "Is anyone there? - Dealing with distributed teams",
              "location": "Ballroom",
              "description": "In the ideal perfect world there will be rainbows and unicorns and teams that all sit together. In reality most teams have to deal with distribution in one form or another. For some its team members spread across a building, for others its team members in other parts   of the world in different time zones. Can Agile work for these teams?",
              "speakerNames": ["Samantha Laing", "Karen Greaves"],
              "timeStart": "1:50 pm",
              "timeEnd": "2:20 pm",
              "tracks": [
                "People and organisational culture"
                ]
            },
            {
              "name": "Business vs IT",
              "location": "Gala Room",
              "description": "In the ideal perfect world there will be rainbows and unicorns and teams that all sit together. In reality most teams have to deal with distribution in one form or another. For some its team members spread across a building, for others its team members in other parts   of the world in different time zones. Can Agile work for these teams?",
              "speakerNames": ["Kevin Trethewey"],
              "timeStart": "1:50 pm",
              "timeEnd": "2:20 pm",
              "tracks": [
                "Building the right thing",
                "Building thing right",
                "People and organisational culture",
                "Leadership"
                ]
            }
          ]
        },
        {
          "time": "2:00 pm",
          "sessions": [
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "2:20 pm",
              "timeEnd": "2:30 pm",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "DevOps - A lean definition",
              "location": "Ballroom",
              "description": "The definition of DevOps has become mired in the tooling and practices that are normally associated with DevOps as opposed to the intent of DevOps itself. This talk attempts to reframe and reorient the definition of DevOps back into it's original Lean and Agile context in a simple and concise manner.",
              "speakerNames": ["Julian Exenberger"],
              "timeStart": "2:30 pm",
              "timeEnd": "3:00 pm",
              "tracks": [
                "DevOps and Continuous Delivery",
                "People and organisational culture"
                ]
            },
            {
              "name": "Specification by example",
              "location": "Gala Room",
              "description": "Have you ever had to read through tests and you can't understand them? Or you are too tired of going through testing abstracts that mean nothing to you? And you wish that there was an easier way to understand the tests functionality? Have you wished there was one single source of truth for a project that could be used for the clients, business analysts and development team? Specification by example could be what you are looking for. It is a testing architecture which can be used by all the stakeholders of a project to understand how a system works and the examples of scenarios expected.",
              "speakerNames": ["Ann Mwangi"],
              "timeStart": "2:30 pm",
              "timeEnd": "3:00 pm",
              "tracks": [
                "People and organisational culture",
                "Quality Early and Testing"
                ]
            }
          ]
        },
        {
          "time": "3:00 pm",
          "sessions": [
            {
              "name": "Tea and Move",
              "location": "Indaba Tree Room",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "3:00 pm",
              "timeEnd": "3:30 pm",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "Travelling light – The pros and perils of lean documentation",
              "location": "Ballroom",
              "description": "Have you ever been on a long haul overseas trip, where you loaded your hand luggage with items like laptops, books and electronic devices – just to make sure that you weren’t bored on the flight? Only to be left trudging around airport duty free shops while waiting for connecting flight, wondering why you feel like you packed bricks in your backpack. Projects carry a lot of baggage too… documentation. Someone has to create it, someone has to read it, someone has to sign it, someone has to (or is meant to) maintain it, and eventually someone needs to identify if it is still valuable. That’s a lot of work for something we might not even use! Agile approaches value working software over comprehensive documentation. But what does that really mean? ",
              "speakerNames": ["Angie Doyle"],
              "timeStart": "3:30 pm",
              "timeEnd": "3:45 pm",
              "tracks": [""]
            },
            {
              "name": "Fish ponds and Agile",
              "location": "Gala Room",
              "description": "The adoption of Agile in majority of South African companies, specifically larger ones, is non effective. Primary reason is that the main focus is at the team level and mainly the practices. Values and principles extend beyond the team, and without support from the greater organisation, majority of these are difficult to adopt.",
              "speakerNames": ["Dillon Weyer"],
              "timeStart": "3:30 pm",
              "timeEnd": "3:45 pm",
              "tracks": [
                "People and organisational culture",
                "Leadership"
                ]
            },
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "3:45 pm",
              "timeEnd": "4:00 pm",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "4:00 pm",
          "sessions":[
            {
              "name": "Keynote: Self-selection",
              "location": "Ballroom",
              "description": "",
              "speakerNames": ["Sandy Mamoli"],
              "timeStart": "4:00 pm",
              "timeEnd": "???? pm",
              "tracks": [""]
            }
          ]
        }
      ]
    },
    {
      "date": "2016-08-23",
      "groups": [
        {
          "time": "9:00 am",
          "sessions": [
            {
              "name": "Announcements",
              "location": "Ballroom",
              "timeStart": "9:00 am",
              "timeEnd": "9:10 am",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "Keynote: Why does Yesterday’s Best Practice Become Tomorrow’s Antipattern?",
              "location": "Ballroom",
              "speakers": "Neal Ford",
              "timeStart": "9:10 am",
              "timeEnd": "10:10 am",
              "tracks": [""]
            }
          ]
        },
        {
          "time": "10:00",
          "sessions": [
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "timeStart": "10:10 am",
              "timeEnd": "10:20 am",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "Unlocking ScrumMastery through the ScrumMaster Academy",
              "location": "Ballroom",
              "speakers": "Biase De Gregorio",
              "description": "This talk focuses on how we solved this problem by creating a sustainable learning opportunity for internal staff to become great ScrumMasters through a focused, 13 - and then a 10 -  week programme called the ScrumMaster Academy. We used the pilot programme as an experiment by providing training, coaching and mentoring 16 ScrumMaster apprentices through a Coaching Collective.",
              "timeStart": "10:20 am",
              "timeEnd": "10:50 am",
              "tracks": [
                "People and organisational culture",
                "Leadership"
              ]
            },
            {
              "name": "Behavior Driven develop your Agile Projects",
              "location": "Gala Room",
              "speakers": "Rory Preddy",
              "description": "JBehave is a framework for Behavior-Driven Development (BDD). BDD is an evolution of test-driven development (TDD) and acceptance-test driven design. It shifts the vocabulary from being test-based to behavior-based, and positions itself as a design philosophy. BDD revolves around the concept of a Story, which represents an automatically executable increment of business functionality. At its core a Story comprises of one or more Scenarios, each of which represents a concrete example of the behavior of the system. Scenarios are written in Given, When, Then format, also known as Gherkin: Given/When/Then is a very powerful idiom, that allows for virtually any requirement to be described. Join me as we use a Continuous Build pipeline to automate a Businesses requirements.",
              "timeStart": "10:20 am",
              "timeEnd": "10:50 am",
              "tracks": [
                "DevOps and Continuous Delivery",
                "People and organisational culture",
                "Quality Early and Testing"
              ]
            },
            {
              "name": "Tea and Move",
              "location": "Indaba Tree Room",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "10:20 am",
              "timeEnd": "10:50 am",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "11:00 am",
          "sessions": [
            {
              "name": "Agilising Product Design, it's not about the process, it's about people",
              "location": "Ballroom",
              "speakers": "Rob Enslin",
              "description": "Designing the right product (over designing it right) has never been more salient now than ever. Do it the 'Agile' way is not going to cut it, nor will defining the Product MVP either, understanding what people need and what problems the Product will help solve does cut it. My 30-min talk will cover the most important phase of Product Design - the problem definition and strategy phase. I'll talk about iterative style approaches, context awareness, and customer definition work.",
              "timeStart": "11:20 am",
              "timeEnd": "11:50 am",
              "tracks": [
                "Building the right thing",
                "Agile UX and Interaction Design"
              ]
            },
            {
              "name": "Demystifying Continuous Delivery",
              "location": "Gala Room",
              "speakers": "Kelvin Mutuma",
              "description": "Most of us using continuous integration and deployment think of it as something complicated, buggy and often hard to set up. If you’re currently using build tools but unsure how it works, this talk will demystify the CI/CD for you. I’ll start by showing different tools, then we will discuss the challenges we found when using them. We will dive into the layers of how an example CI/CD tool is built and we will end up showing how the actual build is run, tested or deployed. When you understand the system, you’ll know the limitations and how to overcome them.",
              "timeStart": "11:20 am",
              "timeEnd": "11:50 am",
              "tracks": [
                "Building thing right",
                "DevOps and Continuous Delivery",
                "Quality Early and Testing"
              ]
            },
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "11:50 am",
              "timeEnd": "12:00 pm",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "12:00 pm",
          "sessions": [
            {
              "name": "A corporate South African success story",
              "location": "Ballroom",
              "speakers": "Candice Mesk",
              "description": "In this session I’m going to walk you through the practices adopted by this team to make mob programming possible and why I feel these practices led them to achieve such a dramatic improvement in delivery time. I will also briefly present some of the supporting data, and explain how it was collected.",
              "timeStart": "12:00 pm",
              "timeEnd": "12:30 pm",
              "tracks": [
                "People and organisational culture"
              ]
            },
            {
              "name": "Requirements Engineering for Agile Product Owners: Hunting Value with Structured Conversations",
              "location": "Gala Room",
              "speakers": "Pavel Dabrytski",
              "description": "Hunting value through conversations. This is a skill that helps product owners when working with stakeholders, analysts and requirements engineers. Start with identifying your project partners, and use seven product dimensions (user, interface, activities, data, control, environment and quality attributes) to uncover correct requirements for your product. Understand how you can use it to focus on value, deliver value and optimise value.",
              "timeStart": "12:00 pm",
              "timeEnd": "12:30 pm",
              "tracks": [
                "Building the right thing",
                "People and organisational culture"
              ]
            },
            {
              "name": "Lunch and Discussions",
              "location": "Indaba Tree Room",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "12:30 pm",
              "timeEnd": "13:00 pm",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "13:00 am",
          "sessions": [
            {
              "name": "Posters",
              "location": "Indaba Tree Room",
              "description": "See posters.",
              "timeStart": "13:00 am",
              "timeEnd": "???? am",
              "tracks": [""]
            },
            {
              "name": "Pivoting Without Pain is Impossible",
              "location": "Ballroom",
              "speakers": "Nyaradzai Samushonga",
              "description": "Pivoting has become a ubiquitous term in agile circles to refer to a decisive change in plan or strategy.  It is rightfully regarded as the very embodiment of being agile.  But pivoting is oh so painful, and an incredibly daunting thought.  Yet, to remain religiously beholden to the original path is folly. In this talk, I will share the series of pivot points on a project that spanned two years, and the ultimate operational transformation that was achieved; far exceeding expectations.  But it did not come without the drama and pain at a team and organisational level.  There is also the brutality of honesty and the loneliness of courageous leadership needed to see the pivot through.",
              "timeStart": "13:40 pm",
              "timeEnd": "14:10 pm",
              "tracks": [
                "People and organisational culture",
                "Leadership"
              ]
            },
            {
              "name": "Evolution of software systems",
              "location": "Gala Room",
              "speakers": "Joshua Lewis",
              "description": "When they are first created, software systems generally have a consistent internal model and structure, which the authors consider a good solution for the problem at hand, considering their context, knowledge and expertise at the time. Over time, this internal structure generally loses its consistency due to a sequence of mutations made to satisfy new requirements. These mutations generally make further changes to the software more difficult, longer to make, and introduce great risk. What often happens is after enough time, developers start recommending a complete rewrite.",
              "timeStart": "13:40 pm",
              "timeEnd": "14:10 pm",
              "tracks": [
                "People and organisational culture",
                "Building the right thing",
                "Building thing right",
                "DevOps and Continuous Delivery"
              ]
            }
          ]
        },
        {
          "time": "14:00 am",
          "sessions": [
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "14:10 pm",
              "timeEnd": "14:15 pm",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "Active Agile: The story of a rewarding scaled agile implementation",
              "location": "Ballroom",
              "speakers": "Justin Doyle",
              "description": "Ten inter-dependent teams, four Scrum Masters and two months to pull them all together to make the launch of what was to become Discovery Vitality’s most successful product to date: Vitality Active Rewards. No pressure. This talk will start by outlining the organisational structure of the agile and non-agile teams involved in the delivery of Active Rewards. The scaled agile approach followed will then be shared, specifically highlighting techniques utilised to help coordinate and synchronise the teams towards constant value delivery in order to make the very tight launch deadline. The benefits realised and lessons learnt from techniques such as joint release and sprint planning and daily Scrum of Scrum ceremonies will be presented, together with further planned improvements to our scaled agile implementation.",
              "timeStart": "14:15 pm",
              "timeEnd": "14:30 pm",
              "tracks": [""]
            },
            {
              "name": "An automated testers dream",
              "location": "Gala Room",
              "speakers": "Paul Lloyd",
              "description": "This presentation is a story (albeit an unfinished story) that starts with a dream - an automated testers dream. The dream of automation is about pressing a button and letting a machine do the work for you… It is about machines and programs doing jobs that you do, but faster and more efficiently. The rest of the story is about my attempts to make that dream a reality – and the journey of successes, challenges and experiences in that process. The story is about my experiences and experiments with test automation, how we integrated them into the build stack and how we were able to enhance testing along with the productivity of the software development team. This presentation will unpack and highlight the processes, challenges and successes that our testing team has been working on for the last 3 Years",
              "timeStart": "14:15 pm",
              "timeEnd": "14:30 pm",
              "tracks": [
                "DevOps and Continuous Delivery"
              ]
            },
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "14:30 pm",
              "timeEnd": "14:35 pm",
              "tracks": ["Admin & Food"]
            },
            {
              "name": "Harnessing your greatest tool, your brain, better.",
              "location": "Ballroom",
              "speakers": "Theodore Carl Bohnen",
              "description": "A master craftsman is more than just his/her tools; he/she does however handle them with the years of experience hard earned. In this talk I will speak about our greatest tool, the brain and how to use it more effectively in developing software.",
              "timeStart": "14:35 pm",
              "timeEnd": "14:50 pm",
              "tracks": [
                "People and organisational culture"
              ]
            },
            {
              "name": "Herding the herd - a coaches perspective",
              "location": "Gala Room",
              "speakers": "Theodore Carl Bohnen",
              "description": "how do you manage learning in self organising systems?",
              "timeStart": "14:35 pm",
              "timeEnd": "14:50 pm",
              "tracks": [
                "People and organisational culture",
                "Leadership"
              ]
            },
            {
              "name": "Tea and Move",
              "location": "Indaba Tree Room",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "14:50 pm",
              "timeEnd": "15:20 pm",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "15:00 am",
          "sessions": [
            {
              "name": "Leader transformation - a side effect of an agile transition",
              "location": "Ballroom",
              "speakers": ["Subash Sharma", "Felicity Brady"],
              "description": "There are many organisations that are attempting to transform from their traditional ways of working towards agile and as such, experience transformation in each part of the organisation. One key aspect is the behavioral transformation that occurs within leaders of the organization. This talk will cover the reflections, transformations, political dynamics and fears of one such leader during our organisations move towards agile. We will also talk about the views of this leaders team and their observations of his transformation.",
              "timeStart": "15:20 pm",
              "timeEnd": "15:00 pm",
              "tracks": ["Leadership"]
            },
            {
              "name": "Move and Stretch",
              "location": "All locations",
              "description": "Remember to visit our sponsors' webpages.",
              "timeStart": "15:50 pm",
              "timeEnd": "16:00 pm",
              "tracks": ["Admin & Food"]
            }
          ]
        },
        {
          "time": "16:00 am",
          "sessions": [
            {
              "name": "Lead with needs",
              "location": "Ballroom",
              "speakers": ["Danie Roux", "Kevin Trethewey"],
              "description": "As a software industry, we suck at providing what matters most to the true customer of what we create. In our human work systems we argue about process, technology and people matters. Day to day, week to week, we get caught up in the minutiae and lose sight of what it is we should really be doing. What really matters, is this: To lead with needs. In this session Kevin and Danie will explore what needs are, how to separate them from wants and how to connect them to the day to day activities that we call software development. Only when needs are explored and used as the ultimate measurement of any change in the system will the system become healthier.",
              "timeStart": "16:00 pm",
              "timeEnd": "16:30 pm",
              "tracks": [
                "People and organisational culture",
                "Building the right thing",
                "Leadership"
              ]
            },
            {
              "name": "Retro & Thanks",
              "location": "Ballroom",
              "description": "",
              "timeStart": "16:30 pm",
              "timeEnd": "???? pm",
              "tracks": [""]
            }
          ]
        }
      ]
    }
  ],


  "speakers": [
    {
      "name": "Jacques de Vos",
      "profilePic": "img/speakers/jacques-head.jpg",
      "twitter": "@jacdevos",
       "about": "nReality founder and dev coach.\nAlways amazed by the limitless potential of tech but also enchanted by our unsolvable puzzles.\nI coach, code, listen and speak."
     },
     {
       "name": "codeX",
       "profilePic": "img/speakers/codeX-logo.jpg",
       "twitter": "@project_codeX",
        "about": "codeX is a full-time apprenticeship 9 to 5, every weekday. Very quickly, you'll build real projects for real companies. You might even get paid for them as you grow your skills, and commit to working for our partners for a time at the end (if they want to hire you).\n\n codeX guides you and gives you a safe space to experiment and grow.\nThere are no formal classes, though you’ll learn industry standard programming languages like Java, PHP, Python, and Javascript. In order to build your projects, you'll be guided through online content with a developer mentor always available to help.\n\ncodeX complements the learn-by-doing approach with daily coding exercises (katas) and talks with industry professionals and mentors so you gain context for your programming knowledge in computer science and business.\n\nBut we only invest in people who invest in themselves."
      },
      {
        "name": "WeThinkCode",
        "profilePic": "img/speakers/wethinkcode-logo.jpeg",
        "twitter": "@wethinkcode",
         "about": "WeThinkCode_ is a new kind of institution dedicated to adress the IT skills gap.\n\n Our mission is to source and develop Africa's future digital talent. We are democratising education, by making our applications open and accessible to all brilliant minds, regardless of previous education or financial means. \n\nStudents pay no tuition, and we partner with corporates, foundations and individuals to sponsor students. We provide corporates access to world-class software engineers. \n\nIf you would like more information on how to get involved, please contact us on sponsor@wethinkcode.co.za"
       },
       {
         "name": "Henrik Kniberg",
         "profilePic": "img/speakers/henrik-head.jpg",
         "twitter": "@henrikkniberg",
          "about": "Henrik Kniberg is an Agile/Lean coach at Crisp in Stockholm, working primarily with Lego and Spotify. He enjoys helping companies succeed with both the technical and human sides of software development. During the past 15 years he has been CTO of 3 Swedish IT companies and helped many more get started with Agile and Lean software development.\n\nHenrik is former board member of the Agile Alliance and works regularly with Mary Poppendieck, Jeff Sutherland, Alistair Cockburn, and other thought leaders. He is the author of “Scrum and XP from the Trenches” and “ Kanban and Scrum, making the most of both” and “Lean from the Trenches“. These books are available in over 12 languages, have over 500,000 readers, and are used as primary guide to Agile and Lean software development by hundreds of companies worldwide.­"
        },
        {
          "name": "Job Mashapa",
          "profilePic": "img/speakers/job-head.jpg",
          "twitter": "",
           "about": "Being a Service Design & User Experience practitioner, Dr, Job Mashapa has seen Agile – Scrum methodologies being practiced in a variety of projects. With practical and academic experience in ICT4D projects, UX, Internet of Things (IoT) and most importantly, real-life technological innovations his view is radically entrenched in disruptive meaningful innovation. Job empathizes with users and strongly upholds user centricity as an overarching principle for converting users into moving advertising billboards through the creation of products with an “addictive” user experience.\n\nJob, holds a PhD in Information Technology with precise interest in User Experience and Change Management. He has international experience in implementing Information and Communication Technologies for Development (ICT4D) projects across the continent. Job is currently working with Freethinking Business Consultants in the capacity of Snr Service Design and User Experience Consultants. Furthermore he is appointed as a Research Associate at Nelson Mandela Metropolitan University."
         },
         {
           "name": "Farai Madzima",
           "profilePic": "img/speakers/farai-head.jpg",
           "twitter": "@farai_uxguy",
            "about": "Farai Madzima, Head of Experience Design, Standard Bank Group\n\n Farai has designed banking apps used every day by people across Africa. Currently he leads Standard Bank’s talented team of designers and researchers in Johannesburg. Their ambition: to make money matters simpler to understand, and simpler to manage.\n\n Farai’s also works to prepare the wider Standard Bank Group to embrace design as a way to do better business. Not just as a way to improve service delivery.\n\n During his time in the UK, Farai designed digital products for BBC, Audi and the Virgin group. Now based in South Africa, he organises the Pixel Up! conference which brings designer from around the world to share ideas in South Africa."
          },
          {
            "name": "Aslam Khan",
            "profilePic": "img/speakers/aslam-head.jpeg",
            "twitter": "@aslamkhn",
             "about": "African software developer. By birth. By choice. For life."
           },
           {
             "name": "Simon Stewart",
             "profilePic": "img/speakers/simon-head.JPG",
             "twitter": "",
              "about": "I run the JavaScript in South Africa conference and am a frequent speaker at tech conferences.\n\n Also run a training (CodeSkills) and a technology consulting (Broken Keyboards Software) business."
            },
            {
              "name": "Austin Fagan",
              "profilePic": "img/speakers/austin-head.jpeg",
              "twitter": "@austin_fagan",
               "about": "I have been facilitating change in teams for the last 10 years as a Scrum Master and agile coach.\n\n I am passionate about finding new ways of building great collaboration and awesome products."
             },
             {
               "name": "Samantha Laing",
               "profilePic": "img/speakers/samantha-head.jpg",
               "twitter": "@samlaing",
                "about": "My personal motto is ‘be brave’, and I embody this by taking on challenges one small step at a time.\n\nMost of my career has been in the IT industry, specifically Software Development.\n Nowadays I find myself guiding and mentoring others with a passion for agile. \n\nThis year my focus has been on experimenting and learning from my failures (and successes) – what a great journey so far."
              },
              {
                "name": "Karen Greaves",
                "profilePic": "img/speakers/karen-head.jpeg",
                "twitter": "@karen_greaves",
                 "about": "We spend so much of our lives at work, yet so many people don't enjoy their jobs.\n\nI perform best when I love my job, and I think this is true for everyone. \nI believe the best way to engage people at work is to make sure they are having fun, making a difference, and getting better at the things they do.\n\n I help people build great teams and deliver great software.\n\nMy entire career has been in software development, with a significant focus on agile approaches, and enough experience with waterfall to understand it's limitations.\n I've worked with XP, Scrum and Kanban in many different environments. \n\nToday I train and coach individuals and teams in being agile."
               },
               {
                 "name": "Kevin Trethewey",
                 "profilePic": "img/speakers/kevin-head.png",
                 "twitter": "@KevinTrethewey",
                  "about": "Founded Driven in 2008, and since then has grown it into a local consultancy with an international reputation.\n\n His specific fields of interest include creating learning organisations, optimising organisations for flow of value,\n and understanding how to assist awesome people to better understand and change messy work systems."
                },
                {
                  "name": "Shanaaz Trethewey",
                  "profilePic": "img/speakers/shanaaz-head.jpg",
                  "twitter": "@shanaazbt",
                   "about": "As a chartered accountant Shanaaz followed a journey of being an auditor, an investment banker, an executive assistant and ultimately a business owner.\n\n Passionate about people, growing and being authentic, she is energised by forward momentum and taking action."
                 }
  ],


  "map": [
    {
      "name": "Wanderers Golf Club",
      "lat": -26.135266,
      "lng": 28.053804,
      "center": true
    }
  ]

}
